results/deepep-deepep-n1-prefill-sm20-cap4096-nogin-isl4096-osl8-c32.log
### tag=deepep-deepep-n1-prefill-sm20-cap4096-nogin-isl4096-osl8-c32
### endpoint=localhost:30000 nnodes=1 tp=8 phase=prefill
### num_sms=20 capacity=4096 gin=gda image=sglang-epv2-efa:pr29525-sm90
### isl=4096 osl=8 num_prompts=96 concurrency=32
### started=2026-08-19T06:17:13Z
W0819 06:17:17.917000 1 torch/utils/_pytree.py:630] <enum 'KernelPreference'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
W0819 06:17:17.938000 1 torch/utils/_pytree.py:630] <enum 'ScaleCalculationMode'> is an Enum subclass and is now natively supported by torch.compile as an opaque value type. Calling register_constant() on Enum subclasses is deprecated and will be an error in a future release.
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/awq/awq.py:52: UserWarning: Only CUDA, HIP and XPU support AWQ currently.
  warnings.warn(f"Only CUDA, HIP and XPU support AWQ currently.")
/sgl-workspace/sglang/python/sglang/srt/layers/quantization/gguf.py:69: UserWarning: Only CUDA, MUSA and NPU support GGUF quantization currently.
  warnings.warn(f"Only CUDA, MUSA and NPU support GGUF quantization currently.")
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
  0%|          | 0/96 [00:00<?, ?it/s]benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='deepseek-ai/DeepSeek-V4-Flash', served_model_name=None, tokenizer='/models/DeepSeek-V4-Flash', num_prompts=96, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=8, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/results/deepep-deepep-n1-prefill-sm20-cap4096-nogin-isl4096-osl8-c32.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:30000/v1/models to become ready...
Server ready in 0.0s.

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang-oai', base_url=None, host='localhost', port=30000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='deepseek-ai/DeepSeek-V4-Flash', served_model_name=None, tokenizer='/models/DeepSeek-V4-Flash', num_prompts=96, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=8, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file='/results/deepep-deepep-n1-prefill-sm20-cap4096-nogin-isl4096-osl8-c32.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, flush_cache_timeout=60.0, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 393216
#Output tokens: 768
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 96/96 [00:08<00:00, 11.80it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     96        
Benchmark duration (s):                  8.15      
Total input tokens:                      393216    
Total input text tokens:                 393216    
Total generated tokens:                  768       
Total generated tokens (retokenized):    768       
Request throughput (req/s):              11.78     
Input token throughput (tok/s):          48243.59  
Output token throughput (tok/s):         94.23     
Peak output token throughput (tok/s):    191.00    
Peak concurrent requests:                64        
Total token throughput (tok/s):          48337.81  
Concurrency:                             31.30     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   2657.32   
Median E2E Latency (ms):                 2692.09   
P90 E2E Latency (ms):                    2759.15   
P95 E2E Latency (ms):                    2950.61   
P99 E2E Latency (ms):                    2964.54   
---------------Time to First Token----------------
Mean TTFT (ms):                          1041.00   
Median TTFT (ms):                        1029.38   
P90 TTFT (ms):                           1352.37   
P95 TTFT (ms):                           1493.94   
P99 TTFT (ms):                           1506.28   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          230.90    
Median TPOT (ms):                        237.71    
P90 TPOT (ms):                           283.36    
P95 TPOT (ms):                           289.95    
P99 TPOT (ms):                           308.43    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           231.25    
Median ITL (ms):                         178.48    
P90 ITL (ms):                            374.30    
P95 ITL (ms):                            642.32    
P99 ITL (ms):                            926.79    
Max ITL (ms):                            1090.71   
==================================================
### finished=2026-08-19T06:17:45Z rc=0